# HorizontalAlignment Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ScheduleField..::..HorizontalAlignment Property
ScheduleField Class See Also
---
The horizontal alignment of text in the column.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleHorizontalAlignment HorizontalAlignment { get; set; }
```

Visual Basic
---
```text
Public Property HorizontalAlignment As ScheduleHorizontalAlignment
	Get
	Set
```

Visual C++
---
```text
public:
property ScheduleHorizontalAlignment HorizontalAlignment {
	ScheduleHorizontalAlignment get ();
	void set (ScheduleHorizontalAlignment value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace